#define TC 0 //　ド
#define TD 1 //　レ
#define TE 2 //　ミ
#define TF 3 //　ファ
#define TG 4 //　ソ
#define TA 5 //　ラ
#define TB 6 //　シ
#define TX 7

int fq[]={262,294,330,349,392,440,494,0}; // 音階の周波数（Hz)ドレミ・・・
//メロディ配列データmo:「ドレミの歌」
int mo[45][2]={{TC,500},{TD,500},{TE,1000},{TX,1000}, {TC,500},{ TD,500}, {TE,1000},{TX,1000},
            {TG,500},{TE,500},{TD,500}, {TC,500},{ TD,500}, {TE,500},{TD,1000},{TX,1000},
            {TC,500},{TD,500},{TE,1000}, {TX,1000},{TC,500},{ TD,500}, {TE,1000},{TX,1000},
            {TG,500},{TE,500},{TD,500}, {TC,500},{ TD,500}, {TE,500},{TC,1000},{TX,1000},
            {TG,500},{TG,500},{TE,500},{TG,500},{TA,500},{TA,500},{TG,1000},{TX,1000},
            {TE,500},{TE,500},{TD,500},{TD,500},{TC,1000}};
void setup() {
 for(int i=0; i<45; i++){
   tone(12,fq[mo[i][0]],mo[i][1]); //メロディ配列データmoを演奏
   delay(500);
 }
}
void loop() { }

